departments = [
    "中文系", "中文所", "外文系", "外文所", "歷史系", "歷史所", "哲學系", "哲學所", "語言所", "英語教學所",
    "台文創應所", "數學系", "應數所", "地震所", "物理系", "物理所", "統科所", "地環系", "地環所", "數學所",
    "分子生物所", "生醫系", "生醫所", "化暨生化系", "化暨生化所", "社福系", "社福所", "心理系", "心理所",
    "勞工系", "勞工所", "政治系", "政治所", "傳播系", "電傳所", "戰略所", "臨床心理所", "資工系", "資工所",
    "電機系", "電機所", "機械系", "機械所", "化工系", "化工所", "通訊系", "通訊所", "光機電所", "國際智慧製造碩士專班",
    "經濟學系", "國經所", "財金系", "財金所", "企管系", "企管所", "會資系", "會資所", "資管系", "資管所",
    "行銷與數位分析碩士班", "醫療資訊管理所", "法律系", "法律所", "財法系", "財法所", "成教系", "成教所",
    "教育所", "犯防系", "犯防所", "休閒教育所", "運競系", "課研所", "高齡教育所", "不分系"
]